 /*
	Написати функцію яка визначить середню оцінку кожного студента по кожному предмету у фоматі A, B, C, D, E
	Вхідні дані:
		data - не відсортований масив об'єктів вигляду {student: "StudentA", "subject": "History", mark: 67}
		кожен об'єкт представляє інформацію по одній оцінці одного студента по певному предмету, необхідно визначити
		середню оцінку кожного студента по кожному предмету у вигляді:
		 0 < F < 60
		 61 < D < 70
		 71 < C < 80
		 81 < B < 90
		 91 < A < 100

	Результуюча стрічка має містити відсортовану в алфавітному порядку послідовність де кожен новий запис буде з
	нового рядка
	StudentA History 67 - студент предмет оцінка
 */

var solution = function(data) {
// write you code here...
};

module.exports = solution;