/*
	Написати фунцію для сортування масиву довільних об'єктів
	Вхідні параметри:
	    items - масив довільних об'єктів однакової структури, наприклад: [{name: "name1"}, {name: "name2"}]
	    field - поле по якому відбувається сортування
	    order - стрічка "asc" якщо необхідно сортувати по зростанню, та "desc" якщо по спаданню
	    selection - поле яке має фігурувати в результуючій послідовності
	Результат:
		стрічка в якій мають бути через кому зазначеня поля selection послідовності
		items відсортованої по спаданню/зростанню(параметр order) значення в полі field
		приклад в sorter.test.js
 */

var solution = function(items, field, order, selection) {
// write you code here...
};

module.exports = solution;